Revit 2024 API
PlanCircuit Members
The PlanCircuit type exposes the following members.
Methods
Name | Description
Dispose
Causes the object to release immediately any resources it may be utilizing.
 (Inherited from APIObject.)
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetPointInside
Returns a point inside the circuit.
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
Area
The enclosed area of the circuit.
IsReadOnly
Identifies if the object is read-only or modifiable.
 (Inherited from APIObject.)
IsRoomLocated
Reports whether there is a room located in this circuit.
SideNum
The number of sides in the circuit.
See Also
PlanCircuit Class
Autodesk.Revit.DB Namespace